import 'package:flutter/cupertino.dart';

double screenHeight = 0.0;

Map<String, dynamic>? errorMessage =  {
  "3": "نوع داده ورودی باید عددی باشد",
  "4": "نوع داده ورودی باید به صورت رشته یا متن باشد",
  "5": "نوع داده ورودی باید صحیح/غلط باشد",
  "6": "ایمیل وارد شده صحیح نمی باشد",
  "7": "پارامتر اجباری می باشد",
  "8": "فقط ورودی از نوع عکس مجاز می باشد",
  "9": "حجم فایل بارگذاری شده بیشتر از حد مجاز است",
  "10": "نوع فایل بارگذاری شده مجاز نیست",
  "11": "شماره تلفن وارد شده صحیح نمی باشد!",
  "12": "شماره تلفن باید فقط شامل عدد باشد",
  "13": "وارد کردن عدد منفی مجاز نمی باشد",
  "14": "طول رشته وارد شده بیشتر از حد مجاز است",
  "15": "طول رشته وارد شده کمتر از حد نصاب است",
  "16": "دسترسی انجام این عملیات را ندارید",
  "17": "انجام این عملیات محدود شده است",
  "phone_start_0": "شماره تلفن وارد شده صحیح نیست.",
  "length_exceed": "حداکثر طول مجاز رد شده است ",
  "persian_name": "نام باید فارسی باشد",
  "persian_lastname": "نام خانوادگی باید فارسی باشد",
  "english_username": "نام کاربری می‌تواند ترکیبی از حروف انگلیسی و اعداد و علامت های _ - . باشد",
  "max_file_size": "حجم فایل بیش از {size} مگابایت می‌باشد",
  "max_file_size_image": "حجم فایل تصویری بیش از {size} مگابایت می‌باشد",
  "max_file_size_video": "حجم فایل ویدیویی بیش از {size} مگابایت می‌باشد",
  "max_file_size_voice": "حجم فایل صوتی بیش از {size} مگابایت می‌باشد",
  "video_max_duration": "مدت زمان فایل ویدیویی بیش از {duration} ثانیه می‌باشد",
  "voice_max_duration": "مدت زمان فایل صوتی بیش از {duration} ثانیه می‌باشد",
  "media_count": "نمی‌توانید محتوای بیشتری اپلود کنید",
  "media_count_image": "نمی‌توان بیشتر از {count} عکس آپلود کرد",
  "media_count_video": "نمی‌توان بیشتر از {count} ویدیو آپلود کرد",
  "media_count_voice": "نمی‌توان بیشتر از {count} صوت آپلود کرد",
  "NetworkException" : "خطا در اتصال به اینترنت",
};

void init(BuildContext context) {
  screenHeight = MediaQuery.of(context).size.height;
}

